app/controllers/addresses_controller.rb

SELECT  `services`.* FROM `services` WHERE `services`.`id` = 3 LIMIT 1
---
    def set_service
      @service = Service.find(params[:service_id])