app/controllers/driver_session_controller.rb

SELECT  `drivers`.* FROM `drivers` WHERE `drivers`.`no_correo` = '' LIMIT 1
---
  def create
  	driver = Driver.find_by(no_correo: params[:driver_session][:email].downcase)