app/controllers/drivers_controller.rb

  def index
    @drivers = Driver.all
---
SELECT `drivers`.* FROM `drivers`

  def create
    @driver = Driver.new(driver_params)

    respond_to do |format|
      if @driver.save
---
INSERT INTO `drivers` (`no_driver`, `no_correo`, `nu_telefono`, `password_digest`, `created_at`, `updated_at`) VALUES ('sdfgsdfg', 'driver@example.com', '3333', '123123', '2015-10-04 22:59:29', '2015-10-04 22:59:29')

  def destroy
    @driver.destroy
---
DELETE FROM `drivers` WHERE `drivers`.`id` = 1

    def set_driver
      @driver = Driver.find(params[:id])
---
SELECT  `drivers`.* FROM `drivers` WHERE `drivers`.`id` IS NULL LIMIT 1