app/controllers/feedbacks_controller.rb

  def index
    @feedbacks = Feedback.all
---
SELECT `feedbacks`.* FROM `feedbacks`

  def create
    @feedback = Feedback.new(feedback_params)
    @feedback.service_id = @service.id

    respond_to do |format|
      if @feedback.save
---
INSERT INTO `feedbacks` (`tx_comentario`, `created_at`, `updated_at`) VALUES ('Este servicio fue una basura. Espero mejoren', '2015-09-29 06:51:39', '2015-09-29 06:51:39')

    def set_user
      @user = User.find(params[:user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

    def set_service
      @service = Service.find(params[:service_id])
---
SELECT  `services`.* FROM `services` WHERE `services`.`id` = 1 LIMIT 1