app/controllers/services_controller.rb

SELECT `services`.* FROM `services`
---
  def index
    @services = Service.all

SELECT  `services`.* FROM `services` WHERE `services`.`id` = 1 LIMIT 1
SELECT  `addresses_services`.* FROM `addresses_services` WHERE `addresses_services`.`service_id` = 1 LIMIT 1
SELECT  `addresses`.* FROM `addresses` WHERE `addresses`.`id` = 1 LIMIT 1
SELECT  `statuses`.* FROM `statuses` WHERE `statuses`.`id` = 1 LIMIT 1
SELECT  `tipo_vehicles`.* FROM `tipo_vehicles` WHERE `tipo_vehicles`.`id` = 1 LIMIT 1
---
  def show
    @service = Service.find(params[:id])
    @addresses = @service.addresses_services
    @a1 = Address.find(@addresses[0][:address_id])
    @a2 = Address.find(@addresses[1][:address_id])
    @status = Status.find(@service.status_id)
    @tipo_vehicle = TipoVehicle.find(@service.tipo_vehicle_id)

SELECT `tipo_vehicles`.* FROM `tipo_vehicles`
---
  def new
    @service = Service.new
    @origin = @service.addresses.new
    @destiny = @service.addresses.new
    @tipo_vehicles = TipoVehicle.all

INSERT INTO `services` (`nu_telefono`, `tipo_vehicle_id`, `payment_method_id`, `fe_fecha`, `fe_hora`, `user_id`, `co_confirmacion`, `status_id`, `created_at`, `updated_at`) VALUES ('956768629', 2, 2, '2015-10-06', '2015-10-06 01:32:00.000000', 1, '15J06005', 1, '2015-10-06 06:32:26', '2015-10-06 06:32:26')
---
  def create
    @service = Service.new(service_params)
    @service.user_id = @user.id
    @service.co_confirmacion = @service.get_cod_confirmacion
    @service.status_id = 1


    respond_to do |format|
      if @service.save

DELETE FROM `services` WHERE `services`.`id` = 1
---
  def destroy
    @service.destroy

SELECT  `services`.* FROM `services` WHERE `services`.`id` = 3 LIMIT 1
---
    def set_service
      @service = Service.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT  `drivers`.* FROM `drivers` WHERE `drivers`.`id` = 1 LIMIT 1
---
    def set_client
      @user = User.find_by(id: params[:user_id])
      @driver = Driver.find_by(id: params[:driver_id])