app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`no_correo` = 'acron.bn@gmail.com' LIMIT 1
---
  def create
  	user = User.find_by(no_correo: params[:session][:email].downcase)