app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @services = Service.where(["user_id = ?", @user.id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT  `services`.* FROM `services` WHERE `services`.`user_id` = 2 LIMIT 1

  def edit
    @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`no_user`, `no_correo`, `password_digest`, `created_at`, `updated_at`) VALUES ('Arturo', 'user01@example.org', '$2a$10$zuyKO0IBTd3yFwE1aUDrB.oQUFtblyNriRcd.V.Jny3WNkf9V/6KW', '2015-10-04 06:29:35', '2015-10-04 06:29:35')

  def update

    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `password_digest` = '$2a$10$d/npjzj4J82tLCKEPoAzXuDKVCVLxqpK2hfk8z3dGJQh0gZsGqSwK', `updated_at` = '2015-10-04 06:45:31' WHERE `users`.`id` = 1