app/controllers/vehicles_controller.rb

SELECT `vehicles`.* FROM `vehicles`
---
  def index
    @vehicles = Vehicle.all

INSERT INTO `vehicles` (`no_marca`, `no_modelo`, `nu_placa`, `tipo_vehicle_id`, `driver_id`, `created_at`, `updated_at`) VALUES ('Toyota', 'Tercel', '123456', 1, 1, '2015-10-06 07:25:49', '2015-10-06 07:25:49')
---
  def create
    @vehicle = Vehicle.new(vehicle_params)
    @vehicle.driver_id = @driver.id

    respond_to do |format|
      if @vehicle.save

DELETE FROM `vehicles` WHERE `vehicles`.`id` = 1
---
  def destroy
    @vehicle.destroy

SELECT  `vehicles`.* FROM `vehicles` WHERE `vehicles`.`id` = 1 LIMIT 1
---
    def set_vehicle
      @vehicle = Vehicle.find(params[:id])

SELECT  `drivers`.* FROM `drivers` WHERE `drivers`.`id` = 1 LIMIT 1
---
    def set_driver
      @driver = Driver.find(params[:driver_id])